src/ExchangePlans/ОбменПартКом83_Сайт_состояние_заявок_exp.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<ExchangePlan>
		<Properties>
			<Name>ОбменПартКом83_Сайт_состояние_заявок_exp</Name>
			<Comment>обмен изменившимися состояниями по заявкам покупателей(express)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУзла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Входящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исходящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

src/InformationRegisters/ЛогОбменовССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЛогОбменовССайтом</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОбработкиСайтом</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СайтСообщениеОбработал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСообщенияВходящий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСообщенияИсходящий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПланОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПланыОбменаССайтом</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SiteID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиПодсистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодсистем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подсистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ПланыОбменаССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПланыОбменаССайтом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПодтвержениеПолученияЗаявок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеОтменыЗаявок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ExchangePlans/ОбменПартКом83_Сайт_состояние_заявок_exp/Ext/ManagerModule.bsl
Функция ПолучитьМетаданные()
	Возврат Метаданные.ПланыОбмена.ОбменПартКом83_Сайт_состояние_заявок_exp;
КонецФункции
Функция URIПространстваИмен() 
	
	Возврат "http://ws-02.part-kom.ru/partkom83/hs/SiteExchange/XMLSchema";
	
КонецФункции
Функция ИмяТипаПоОбъектуМетаданных(вхОбъектМетаданных) 
	Возврат	ОбщегоНазначения.ИмяБазовогоТипаПоОбъектуМетаданных(вхОбъектМетаданных) + "." + вхОбъектМетаданных.Имя;
КонецФункции

Функция ВыгрузитьСообщениеОбмена_ИсторияЗаявок(ИдентификаторУзлаОбмена, НомерПринятого) Экспорт
	
	//Семенов И.П. 06.02.2019 XX-1768(
	ОбменДаннымиКлиентСервер.НачатьЗаписьВИсториюОбменовПоОбъектам();
	//)Семенов И.П.
	
	Если Константы.ВключитьРегистрациюDataExchageModule.Получить() Тогда
		ЗаписьЖурналаРегистрации("Обмен данными.Выгрузка." + Метаданные.ПланыОбмена.ОбменПартКом83_Сайт_состояние_заявок_exp.Синоним,
				УровеньЖурналаРегистрации.Ошибка,,,"Номер сообщения: " + НомерПринятого);
	КонецЕсли;

	МетаданныеПланаОбмена = ПолучитьМетаданные();
	
	Узел1С = ОбменДаннымиКлиентСервер.ПолучитьВходящийУзелОбмена(МетаданныеПланаОбмена, ИдентификаторУзлаОбмена);
	Если НЕ ЗначениеЗаполнено(Узел1С) тогда
		//Семенов И.П. 06.02.2019 XX-1768(
		ОбменДаннымиКлиентСервер.ЗафиксироватьСообщениеВИсторииОбмена(0,ПустаяСсылка(),"",Истина,Истина,"Неправильный параметр номер 1(Узел 1С)");
		//)Семенов И.П.
		ВызватьИсключение "[ВыгрузитьСообщениеОбмена_ИсторияЗаявок_exp]: неправильный параметр номер 1(Узел 1С)";
	КонецЕсли;
	
	УзелСайт = ОбменДаннымиКлиентСервер.ПолучитьИсходящийУзелОбмена(МетаданныеПланаОбмена, ИдентификаторУзлаОбмена);
	Если НЕ ЗначениеЗаполнено(УзелСайт) тогда
		//Семенов И.П. 06.02.2019 XX-1768(
		ОбменДаннымиКлиентСервер.ЗафиксироватьСообщениеВИсторииОбмена(0,ПустаяСсылка(),"",Истина,Истина,"Неправильный параметр номер 1.(Узел Сайт)");
		//)Семенов И.П.
		ВызватьИсключение "[ВыгрузитьСообщениеОбмена_ИсторияЗаявок_exp]: неправильный параметр номер 1.(Узел Сайт)";
	КонецЕсли;
	
	НомерОтправленного = УзелСайт.НомерПринятого;
	Если НомерПринятого > НомерОтправленного Тогда
		//ВызватьИсключение "[ВыгрузитьСообщениеОбмена_ИсторияЗаявок_exp]: Сообщение №"+ НомерПринятого + " ещё не отправлялось(последнее №" + НомерОтправленного + ")";
		ТекстОшибки = "Расхождение счетчиков, ReceivedNo:" + НомерПринятого + ", НомерОтправленного:" + НомерОтправленного;
		ЗаписьЖурналаРегистрации("Обмен данными.Выгрузка.ОбменПартКом83_Сайт_состояние_заявок_exp", УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
		НомерСообщения = НомерПринятого + 1;
		НомерПринятого = НомерОтправленного;
	Иначе
		НомерСообщения = НомерОтправленного + 1;
	КонецЕсли;
		
	ФиксацияПринятогоСообщения(УзелСайт, НомерПринятого);
	
	ТипОбъекты = ФабрикаXDTO.Тип(URIПространстваИмен(), "Объекты");
	ТипСообщениеОбмена = ФабрикаXDTO.Тип(URIПространстваИмен(), "СообщениеОбмена");
	
	Узел = УзелСайт.ПолучитьОбъект();
	Узел.НомерПринятого = НомерСообщения;
	Узел.Записать();
	
	СообщениеОбмена = ФабрикаXDTO.Создать(ТипСообщениеОбмена);
	СообщениеОбмена.ПланОбмена = "orders_express_nn";
	СообщениеОбмена.Отправитель = ЭтотУзел().ИдентификаторУзла;
	СообщениеОбмена.Получатель = ИдентификаторУзлаОбмена;
	СообщениеОбмена.НомерСообщения = НомерСообщения;
	СообщениеОбмена.НомерПринятого = Узел1С.НомерОтправленного;
	
	Объекты = ФабрикаXDTO.Создать(ТипОбъекты);
	СписокОбъектов = Объекты.ПолучитьСписок("Объект");
	
	ДобавитьДанныеПодтверждений(СписокОбъектов, НомерСообщения);
	
	СообщениеОбмена.Объекты = Объекты;
	
	ЗаписьХМЛ = Новый ЗаписьXML;
	ЗаписьХМЛ.УстановитьСтроку("utf-8");
	ЗаписьХМЛ.ЗаписатьОбъявлениеXML();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьХМЛ, СообщениеОбмена);
	
	//Семенов И.П. 06.02.2019 XX-1768(
	//Возврат ЗаписьХМЛ.Закрыть();
	ТекстСообщения = ЗаписьХМЛ.Закрыть();
	ОбменДаннымиКлиентСервер.ЗафиксироватьСообщениеВИсторииОбмена(НомерСообщения, УзелСайт, ТекстСообщения, Истина);
	Возврат ТекстСообщения;
	//)Семенов И.П.
	
КонецФункции
Процедура ФиксацияПринятогоСообщения(ИсходящийУзел, НомерПринятогоСообщения)
	
	//Зафиксируем принятые сообщения о логе загрузки
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЛогОбменовССайтом.ПланОбмена,
	                      |	ЛогОбменовССайтом.Ссылка,
	                      |	ЛогОбменовССайтом.SiteID
	                      |ИЗ
	                      |	РегистрСведений.ЛогОбменовССайтом КАК ЛогОбменовССайтом
	                      |ГДЕ
	                      |	ЛогОбменовССайтом.ПланОбмена В (ЗНАЧЕНИЕ(Перечисление.ПланыОбменаССайтом.ПодтвержениеПолученияЗаявок_express), ЗНАЧЕНИЕ(Перечисление.ПланыОбменаССайтом.ПодтверждениеОтменыЗаявок_express))
	                      |	И НЕ ЛогОбменовССайтом.СайтСообщениеОбработал
	                      |	И ЛогОбменовССайтом.НомерСообщенияИсходящий МЕЖДУ 1 И &НомерПринятогоСообщения");
	Запрос.УстановитьПараметр("НомерПринятогоСообщения", НомерПринятогоСообщения);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.ЛогОбменовССайтом.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка, "Ссылка,ПланОбмена,SiteID");
		Запись.Прочитать();
		Запись.ДатаОбработкиСайтом = ТекущаяДата();
		Запись.СайтСообщениеОбработал = Истина;
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры
Процедура ДобавитьДанныеПодтверждений(СписокОбъектов, НомерСообщения)
	
	КоличествоОбъектов = РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен (Общее)","Количество объектов в обмене", 1000);
	ПодтвержениеПолученияЗаявок = ФабрикаXDTO.Тип(URIПространстваИмен(), "Документы.ЗаявкаПокупателя.Загрузка");
	ПодтверждениеОтменыЗаявок = ФабрикаXDTO.Тип(URIПространстваИмен(), "Документы.ЗаявкаПокупателяОтмена.Загрузка");
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1234
	                      |	ЛогОбменовССайтом.Ссылка,
	                      |	ЛогОбменовССайтом.ПланОбмена,
	                      |	ЛогОбменовССайтом.SiteID,
	                      |	ЛогОбменовССайтом.Ошибка,
	                      |	ЛогОбменовССайтом.ТекстОшибки
	                      |ИЗ
	                      |	РегистрСведений.ЛогОбменовССайтом КАК ЛогОбменовССайтом
	                      |ГДЕ
	                      |	ЛогОбменовССайтом.ПланОбмена В (ЗНАЧЕНИЕ(Перечисление.ПланыОбменаССайтом.ПодтвержениеПолученияЗаявок_express), ЗНАЧЕНИЕ(Перечисление.ПланыОбменаССайтом.ПодтверждениеОтменыЗаявок_express))
	                      |	И НЕ ЛогОбменовССайтом.СайтСообщениеОбработал");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1234", Формат(КоличествоОбъектов, "ЧГ="));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТипОбъектаXDTO = ?(Выборка.ПланОбмена = Перечисления.ПланыОбменаССайтом.ПодтвержениеПолученияЗаявок_express, ПодтвержениеПолученияЗаявок, ПодтверждениеОтменыЗаявок);
		
		ОбъектXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO);
		ЗаполнитьЗначенияСвойств(ОбъектXDTO, Выборка,, "Ссылка");
		ОбъектXDTO.Ссылка = Выборка.Ссылка;
		Если Выборка.ПланОбмена = Перечисления.ПланыОбменаССайтом.ПодтверждениеОтменыЗаявок_express Тогда
			ОбъектXDTO.IDSite = Выборка.SiteID;
		КонецЕсли;
		
		//Семенов И.П. 06.02.2019 XX-1768(
		УИДСсылки = Новый УникальныйИдентификатор(Выборка.Ссылка);
		СсылкаНаОбъект = Документы.ЗаявкаПокупателя.ПолучитьСсылку(УИДСсылки);
		ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(СсылкаНаОбъект, ОбъектXDTO);
		//)Семенов И.П.
		
		СписокОбъектов.Добавить(ОбъектXDTO);
		
		Запись = РегистрыСведений.ЛогОбменовССайтом.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка, "Ссылка,ПланОбмена,SiteID");
		Запись.Прочитать();
		Запись.НомерСообщенияИсходящий = НомерСообщения;
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры
